{
    "place_id": "ChIJ--ZcL-ZBckgRoGWM0mDoCZM",
    "name": "Web Choice UK",
    "link": "https://www.google.com/maps/place/Web+Choice+UK/data=!4m7!3m6!1s0x487241e62f5ce6fb:0x9309e860d28c65a0!8m2!3d51.4914871!4d-2.5994386!16s%2Fg%2F1v8y3h7l!19sChIJ--ZcL-ZBckgRoGWM0mDoCZM?authuser=0&hl=en&rclk=1",
    "main_category": "Website designer",
    "categories": [
        "Website designer",
        "E commerce agency",
        "Internet marketing service"
    ],
    "rating": 4.6,
    "reviews": 67,
    "address": "Web Choice UK, Henleaze House, 13 Harbury Rd, Henleaze, Bristol BS9 4PN, United Kingdom",
    "website": "https://www.webdesignchoice.co.uk/",
    "about": "Web Choice UK - Award-winning Digital Marketing Agency. We Build Custom Websites & SEO Strategies That Generate Leads and Sales. We are an award-winning digital marketing agency with offices in London and Somerset, serving clients both locally and internationally since 2009. Our company offers a diverse range of services including Web Design, Web Development, SEO, Social Media Marketing, PPC campaigns, E-mail marketing etc.\nContact us today for a free quote on your project!",
    "featured_image": "https://streetviewpixels-pa.googleapis.com/v1/thumbnail?panoid=CMvqKM7vM8MUhkMP_VL1fg&cb_client=search.gws-prod.gps&w=211&h=120&yaw=23.607988&pitch=0&thumbfov=100",
    "phone": null,
    "all_images": "{https://lh5.googleusercontent.com/p/AF1QipNVXrDtlm1OsnUCjWNYRMhFcXw137YCKI92rh34=w298-h298-k-no, https://streetviewpixels-pa.googleapis.com/v1/thumbnail?panoid=CMvqKM7vM8MUhkMP_VL1fg&cb_client=maps_sv.tactile.gps&w=224&h=298&yaw=23.607988&pitch=0&thumbfov=100, https://lh5.googleusercontent.com/p/AF1QipMX998BFU6iBNldAy1jFUNx7cUYQeimLOJyVt91=w298-h298-k-no, https://lh5.googleusercontent.com/p/AF1QipNNbv5QMk5Af_uDMWZGe3EgCLv1BPqcZyy-FMjX=w529-h298-k-no}",
    "detailed_reviews": [
        {
            "reviewer": "max black",
            "reviewer_image": "https://www.google.com/maps/contrib/106055852306120167541?hl=en-US",
            "review": "i would just like to thank sam and the team for doing such a great job for me, they were patient and had a good understanding of what i needed doing, their work is really amazing  and  i would be happy to continue working with them."
        },
        {
            "reviewer": "TavernCreative",
            "reviewer_image": "https://www.google.com/maps/contrib/117861425096899349123?hl=en-US",
            "review": "Update after their reply: My 1 month paternity leave would have had little impact considering delivery was 12 months later than promised. If anyone is considering using Web Choice and would like to see the emails, timeline of events and issues, feel free to contact me\n\nChoosing Webchoice to create our website was a Badchoice.\n\nIn September 2021 we commissioned them to create our new website with a brief to completely reimagine and redesign our current site. In October the first-look came back and it was almost identical to our existing site. They were kind enough to start again and we approved the new look, with a 3-month timeline for the build.\n\nAfter the 3 months I began questioning when it would be ready. 'Very soon' I was assured. In April 2022 our existing WIX subscription was up for renewal, so I chased up again and I was told the website was almost complete. I didn't renew out WIX site and accepted we may have a few weeks without a live website.\n\nBy July 2022 we still didn't have a website and I continued to chase. Despite being very meticulous in ensuring there would be no hidden costs in the early days, I was told they couldn't upload our products and would need to charge me £300+ to do this manually. Reluctantly I paid as I was conscious we were losing thousands per month by not having a website at all.\n\nBy September 2022 there was still no sign of the website and I had finally lost my patience with them and asked to cancel and refund. They of course refused and suggested I can either take legal action or allow them to direct additional resources to get the job done. I accepted the additional resources with a new completion date of December 2022.\n\nBy December 2022 the website was still not complete. I was dealing with one or two people based in India and they weren't able to clarify to me what the 'extra resources' were. It was clear to me by this point they lacked the expertise to complete the job but failed to admit their shortcomings.\n\nOur busy period is January-March, so in January 2023 I asked them to launch the site on the basis that it was better for us to have some online presence rather than none at all, after losing 8 months of website revenue in the previous year.\n\nThe website launched unfinished and I was forced to instruct a new company to complete the work at the cost of £800+. The new company completed the work without issue in a matter of weeks. They noted the initial 3-5 hour of work billed to me was spent cleaning up the mess Webchoice had made.\n\nIn addition all of the products I had paid them £300 to add to the site had to be removed and replaced, as they had used low res images on every listing, the pricing was wrong on most products and the listing descriptions didn't match the products they were listed under.\n\nAfter 4 months since launch we're still having countless issues with our site, most notably a plugin they used to create the building blocks of the design and layout. The plugin they used was a free version, which has now expired forcing me to either redesign the site from scratch or pay the costly subscription for this plugin.\n\nThe website I paid £10,000 for was nothing more than a wordpress template. A website I could have designed myself and wish I had.\n\nI chose Webchoice because I wanted an outstanding website to take our business to the next level and instead I was met with a team of amateurs who simply outsourced their work to India and then became very defensive whenever I questioned their actions and delays - blaming anyone but themselves and failing to accept they simply could not do the job."
        },
        {
            "reviewer": "LinkNLearn Training",
            "reviewer_image": "https://www.google.com/maps/contrib/114018073184235977667?hl=en-US",
            "review": "These guys know their stuff! Grade A - I've known Sam for a long time and he is a real expert. Can't recommend them enough"
        },
        {
            "reviewer": "Andrew Whitman",
            "reviewer_image": "https://www.google.com/maps/contrib/105390751387888359995?hl=en-US",
            "review": "I approached Web Choice UK about developing a fairly niche website for me personally, with quite a complex agenda (at least as a relatively non-techy person!). It was to help me promote a book and tour I am working on about about the history of the Jesus People revival in the late 60s and early 70s. The team definitely grasped what I was trying to achieve really ably.\n\nThe team have been incredibly helpful from start to finish, and nothing has been too much trouble. They also know how to communicate in a way that's accessible to someone like me who is not that knowledgeable about websites. The quality of their work has been high calibre, and has already met with great responses from those in a similar space to me...\nIn particular they have worked well to deadlines too. My calls for tweaks have been met with courtesy and efficiency as well...\n\nI would say the price was excellent value as well, which I'm very pleased about as I had a specific budget in mind, which was not massive, due to my work being essentially charitable really.\n\nA truly professional job all-round, with great customer satisfaction on my part. This website will make a huge difference to my ongoing work... Many thanks Tom, Philip and the team!"
        },
        {
            "reviewer": "Callum Bridgford-Whittick (FiftyCal)",
            "reviewer_image": "https://www.google.com/maps/contrib/117036677300987287960?hl=en-US",
            "review": "Teamed up with these guys for websites and SEO - solid results and team. Well worth  a convo for your project."
        },
        {
            "reviewer": "Tom Breza",
            "reviewer_image": "https://www.google.com/maps/contrib/112035209738473002746?hl=en-US",
            "review": "Sam and his team created an amazing website for us. It is responsive, looks great.\n\nI am glad we have picked this team for the task as IT company frequently we are asked to recommend someone to help with the website and I will pass Sam details."
        },
        {
            "reviewer": "aasim chowdhury",
            "reviewer_image": "https://www.google.com/maps/contrib/107051251480585387450?hl=en-US",
            "review": "GMS Tech supported us in web design, development and digital marketing. Thanks to their knowledge and determination our website looks great, it functions really well and includes a high level of interactivity. Would highly recommend to anyone!"
        },
        {
            "reviewer": "Consenna Visualising Value",
            "reviewer_image": "https://www.google.com/maps/contrib/105900078204367066428?hl=en-US",
            "review": "From the moment I contacted Web Choice their speed of response and quality of service was evident. Sam responded within two hours of me leaving my contact details on their website. He quickly set up a project scoping call and it was clear that he'd read and understood our brief. We made it clear that we were looking for a world class website. We were impressed with the Web Choice approach. Sam then sent us a quotation with a detailed cost break-down. The pricing was favourable in comparison to other quotes we'd had. Once we agreed to proceed we were sent the Web Choice welcome deck which detailed their thorough process . Next we had our kick-off meeting. Sam was our project manager however Tom and Rijo were also extremely helpful and responsive throughout the process. Web Choice were patient with us and allowed us to tweak elements of the design, text and animation. We're delighted with our website both from a user experience and design perspective. The website is responsive and works brilliantly on any device. Web Choice exceeded our expectations. I can't recommend them highly enough."
        }
    ],
    "is_spending_on_ads": false
}