{
    "place_id": "ChIJa8YcFFm02EcRorcCjs3VKBE",
    "name": "WeDesign UK",
    "link": "https://www.google.com/maps/place/WeDesign+UK/data=!4m7!3m6!1s0x47d8b459141cc66b:0x1128d5cd8e02b7a2!8m2!3d51.3818381!4d0.2959557!16s%2Fg%2F11b7yq_bjf!19sChIJa8YcFFm02EcRorcCjs3VKBE?authuser=0&hl=en&rclk=1",
    "main_category": "Website designer",
    "categories": [
        "Website designer"
    ],
    "rating": 5,
    "reviews": 24,
    "address": "WeDesign UK, Gay Dawn Farm, Longfield DA3 8LY, United Kingdom",
    "website": "https://www.wedesignuk.co.uk/",
    "about": "We are your trusted partner for exceptional web design solutions in Kent and beyond. We are a passionate team of creative professionals dedicated to crafting stunning websites that help businesses thrive in the digital world.\n\nAt WeDesign UK, we believe that every business deserves a captivating online presence that reflects its unique brand identity and engages its target audience. With our expertise in web design and development, we transform your ideas into visually appealing, user-friendly, and functional websites that leave a lasting impression.\n\nOur team of talented designers and developers possesses a deep understanding of the latest design trends, technologies, and best practices...",
    "featured_image": "https://lh5.googleusercontent.com/p/AF1QipOqvKIBSkza3jzaDo8pqS5UNe7AH13co4UBlLHH=w360-h175-k-no",
    "phone": "+441474612022",
    "all_images": "{, https://lh5.googleusercontent.com/p/AF1QipOqvKIBSkza3jzaDo8pqS5UNe7AH13co4UBlLHH=w612-h298-k-no}",
    "detailed_reviews": [
        {
            "reviewer": "S Shoker",
            "reviewer_image": "https://www.google.com/maps/contrib/105235296075940228008?hl=en-US",
            "review": "The WeDesign team were efficient and friendly from the offset. We went for a consultation and design meeting in his offices and James fully understood what we were after. He was friendly, knowledgeable and experienced in his field. I had full confidence in him to create what we needed. Thank you very much!!"
        },
        {
            "reviewer": "Rupesh Shiyani",
            "reviewer_image": "https://www.google.com/maps/contrib/102039133825860508104?hl=en-US",
            "review": "I used WeDesign UK for my website, James is a mastermind when it comes to this. He has all the answers, he finds the solution and works professionally. I am incredibly happy with the outcome of the site and even more with the service they provide. Highly recommend 👍"
        },
        {
            "reviewer": "Sean Ratcliffe",
            "reviewer_image": "https://www.google.com/maps/contrib/101687999878538779991?hl=en-US",
            "review": "James has been quite simply fantastic throughout providing a friendly yet professional service.\n\nHe recently created my a stylish, modern online shop for my motorcycle parts sales company which I plan to launch in the next month.\n\nNeedless to say aftercare has been second to none, highly recommended for any form of web design."
        },
        {
            "reviewer": "Jared Foster",
            "reviewer_image": "https://www.google.com/maps/contrib/102601852287712018500?hl=en-US",
            "review": "James is a talent to the web design industry, amazing service, very happy with the outcome. Thank you from J-Tek Electrical"
        },
        {
            "reviewer": "Elizabeth Winchester",
            "reviewer_image": "https://www.google.com/maps/contrib/108144844363373604531?hl=en-US",
            "review": "The team at WeDesign UK have gone above and beyond at every opportunity. I recently needed a website for my catering business, so that it looked good for the big event companies.\nVery easy to deal with and i'll happily recommend them to others going forward."
        },
        {
            "reviewer": "Wendy Ambrose",
            "reviewer_image": "https://www.google.com/maps/contrib/107637023506479419329?hl=en-US",
            "review": "I have nothing but praise for James & WeDesign. They built my website for me, manage it still and got me to the first page on Google for my profession. They never make me feel stupid with my total lack of  I.T knowledge and they respond quickly & accurately to all my email requests. Above all, I have peace of mind that my website is both robust and in safe hands."
        },
        {
            "reviewer": "Richard Arnold",
            "reviewer_image": "https://www.google.com/maps/contrib/103399119094419373556?hl=en-US",
            "review": "James and the team have become our website partner, taking care of everything on our website from initial design right through to management and updates. They are always on hand to take a quick phone call or can schedule a more in depth meeting to meet your needs. I have no reason to go anywhere else for my business website from now on."
        },
        {
            "reviewer": "Horsepower 4 Hire",
            "reviewer_image": "https://www.google.com/maps/contrib/113160727363478995851?hl=en-US",
            "review": "I can’t thank James at WeDesign UK enough for his time, patience and expertise in building the perfect website for our brand new small business. Not only is he extremely talented, but he also went above and beyond to make the experience as simple as possible. No detail was too much trouble and he came up with innovative solutions to challenges in delivering our service online. Highly, highly recommended - choose this company to build your website, you won’t look back!"
        }
    ],
    "is_spending_on_ads": false
}