{
    "place_id": "ChIJl6CjPZ6n2EcRE4D2tkNA-zQ",
    "name": "The UK Web Design Company",
    "link": "https://www.google.com/maps/place/The+UK+Web+Design+Company/data=!4m7!3m6!1s0x47d8a79e3da3a097:0x34fb4043b6f68013!8m2!3d51.5562153!4d0.0192459!16s%2Fg%2F1ptxhh7z4!19sChIJl6CjPZ6n2EcRE4D2tkNA-zQ?authuser=0&hl=en&rclk=1",
    "main_category": "Website designer",
    "categories": [
        "Website designer",
        "Design agency"
    ],
    "rating": 5,
    "reviews": 38,
    "address": "The UK Web Design Company, 129 Thorpe Rd, London E7 9ED, United Kingdom",
    "website": "https://the-web-design-company.co.uk/",
    "about": "Very experienced London website designers with over 23 years of experience. We go above and beyond to help our clients. Offering Web Design Prices that great value & very affordable.\n\nWe provide websites, updates, logos, business card designs and more. Our reputation is impeccable and we have worked very hard to earn it.\n\nOur offices are based in London and Essex.",
    "featured_image": "https://streetviewpixels-pa.googleapis.com/v1/thumbnail?panoid=ru4tefpvknHtVZjRGdZp1w&cb_client=search.gws-prod.gps&w=211&h=120&yaw=72.7036&pitch=0&thumbfov=100",
    "phone": "+447944062954",
    "all_images": "{, https://lh5.googleusercontent.com/p/AF1QipMATWhajwPzn0zqsP_7EG3XYOhC3gbuxuLPrF06=w398-h298-k-no, https://lh5.googleusercontent.com/p/AF1QipP2wMHNhdzSeNxkzGzpnLxVajMvD6Qhk2yykWX3=w224-h299-k-no, https://streetviewpixels-pa.googleapis.com/v1/thumbnail?panoid=ru4tefpvknHtVZjRGdZp1w&cb_client=maps_sv.tactile.gps&w=224&h=298&yaw=72.7036&pitch=0&thumbfov=100}",
    "detailed_reviews": [
        {
            "reviewer": "Emma Jane Martin",
            "reviewer_image": "https://www.google.com/maps/contrib/115829481641130637100?hl=en-US",
            "review": "Set up our site fast & efficiently! Very methodical and a great help, on hand by call, text or Teams whenever needed, highly recommended! Great work thank you."
        },
        {
            "reviewer": "Arbind Gupta",
            "reviewer_image": "https://www.google.com/maps/contrib/103675712184391584735?hl=en-US",
            "review": "Joe was very professional and worked hard on my website with plenty of innovative ideas\nDr Arbind Gupta"
        },
        {
            "reviewer": "Federica Romagnolo",
            "reviewer_image": "https://www.google.com/maps/contrib/107506485002184640033?hl=en-US",
            "review": "Thanks to Joseph for the brilliant job done for our business website, he gave a  fresh new looking to our old web page. For sure we will give a very good impression to our new client. Highly recommend!!"
        },
        {
            "reviewer": "Jay Jay",
            "reviewer_image": "https://www.google.com/maps/contrib/113724147392895040964?hl=en-US",
            "review": "I would like to thank Joseph from The UK Web Design Company, for doing an excellent job on my most recent website. Joseph listened to my request, and implemented exactly what I was after. His communication efficiency, and overall professionalism during the entire process were consistent and reassuring. Joseph's skillful approach and clarity were very much appreciated, and the end result was exactly what I had imagined! Thank you Joseph."
        },
        {
            "reviewer": "AG Flooring",
            "reviewer_image": "https://www.google.com/maps/contrib/106919846906767242461?hl=en-US",
            "review": "Excellent service provided by Joseph and the Team. Highly recommended!!! great communication, very easy to deal with and they go above and beyond. Brilliant website design, its exactly what we were looking for and very reasonably priced for the service we received, cannot fault a single thing. Very Happy customers!!!"
        },
        {
            "reviewer": "David Nelson",
            "reviewer_image": "https://www.google.com/maps/contrib/100394594980785992226?hl=en-US",
            "review": "We are very excited to be working with Joseph on our global web presence. The attention to detail he has given made sure we had great results with the first site release (no need for endless tweaks and corrections). Very highly recommended."
        },
        {
            "reviewer": "Global Supercar Solutions",
            "reviewer_image": "https://www.google.com/maps/contrib/117304653097670302896?hl=en-US",
            "review": "As a novice to this industry and with all the bad experience have had with other designers. I wished I found you 2 years ago! Joeseph has been so amazing, his communications was fantastic, he was extremely Quick and understands what customers want. Extremely professional\n\nI was so impressed with the speed of his work that he even presented it well before his estimation time!\n\nI strongly recommend this company!"
        },
        {
            "reviewer": "Alan Gayle",
            "reviewer_image": "https://www.google.com/maps/contrib/108431745100302564909?hl=en-US",
            "review": "The Web Design Company we're extremely helpful and supportive from the minute they received our enquiry right through to the finished website going live. They produced exactly what we wanted and created an exceptional modern and future proof website. We was provided with a very personal yet highly professional service, I would  not hesitate to recommend this company to anybody who is looking for a quality website with quality advice and support for a very cost effective price."
        }
    ],
    "is_spending_on_ads": false
}