{
    "query": "Web Designers in Uk",
    "places": [
        {
            "place_id": "ChIJa8YcFFm02EcRorcCjs3VKBE",
            "name": "WeDesign UK",
            "link": "https://www.google.com/maps/place/WeDesign+UK/data=!4m7!3m6!1s0x47d8b459141cc66b:0x1128d5cd8e02b7a2!8m2!3d51.3818381!4d0.2959557!16s%2Fg%2F11b7yq_bjf!19sChIJa8YcFFm02EcRorcCjs3VKBE?authuser=0&hl=en&rclk=1",
            "main_category": "Website designer",
            "categories": [
                "Website designer"
            ],
            "rating": 5,
            "reviews": 24,
            "address": "WeDesign UK, Gay Dawn Farm, Longfield DA3 8LY, United Kingdom",
            "website": "https://www.wedesignuk.co.uk/",
            "about": "We are your trusted partner for exceptional web design solutions in Kent and beyond. We are a passionate team of creative professionals dedicated to crafting stunning websites that help businesses thrive in the digital world.\n\nAt WeDesign UK, we believe that every business deserves a captivating online presence that reflects its unique brand identity and engages its target audience. With our expertise in web design and development, we transform your ideas into visually appealing, user-friendly, and functional websites that leave a lasting impression.\n\nOur team of talented designers and developers possesses a deep understanding of the latest design trends, technologies, and best practices...",
            "featured_image": "https://lh5.googleusercontent.com/p/AF1QipOqvKIBSkza3jzaDo8pqS5UNe7AH13co4UBlLHH=w360-h175-k-no",
            "phone": "+441474612022",
            "all_images": "{None, https://lh5.googleusercontent.com/p/AF1QipOqvKIBSkza3jzaDo8pqS5UNe7AH13co4UBlLHH=w612-h298-k-no}",
            "detailed_reviews": [
                {
                    "reviewer": "S Shoker",
                    "reviewer_image": "https://www.google.com/maps/contrib/105235296075940228008?hl=en-US",
                    "review": "The WeDesign team were efficient and friendly from the offset. We went for a consultation and design meeting in his offices and James fully understood what we were after. He was friendly, knowledgeable and experienced in his field. I had full confidence in him to create what we needed. Thank you very much!!"
                },
                {
                    "reviewer": "Rupesh Shiyani",
                    "reviewer_image": "https://www.google.com/maps/contrib/102039133825860508104?hl=en-US",
                    "review": "I used WeDesign UK for my website, James is a mastermind when it comes to this. He has all the answers, he finds the solution and works professionally. I am incredibly happy with the outcome of the site and even more with the service they provide. Highly recommend "
                },
                {
                    "reviewer": "Sean Ratcliffe",
                    "reviewer_image": "https://www.google.com/maps/contrib/101687999878538779991?hl=en-US",
                    "review": "James has been quite simply fantastic throughout providing a friendly yet professional service.\n\nHe recently created my a stylish, modern online shop for my motorcycle parts sales company which I plan to launch in the next month.\n\nNeedless to say aftercare has been second to none, highly recommended for any form of web design."
                },
                {
                    "reviewer": "Jared Foster",
                    "reviewer_image": "https://www.google.com/maps/contrib/102601852287712018500?hl=en-US",
                    "review": "James is a talent to the web design industry, amazing service, very happy with the outcome. Thank you from J-Tek Electrical"
                },
                {
                    "reviewer": "Elizabeth Winchester",
                    "reviewer_image": "https://www.google.com/maps/contrib/108144844363373604531?hl=en-US",
                    "review": "The team at WeDesign UK have gone above and beyond at every opportunity. I recently needed a website for my catering business, so that it looked good for the big event companies.\nVery easy to deal with and i'll happily recommend them to others going forward."
                },
                {
                    "reviewer": "Wendy Ambrose",
                    "reviewer_image": "https://www.google.com/maps/contrib/107637023506479419329?hl=en-US",
                    "review": "I have nothing but praise for James & WeDesign. They built my website for me, manage it still and got me to the first page on Google for my profession. They never make me feel stupid with my total lack of  I.T knowledge and they respond quickly & accurately to all my email requests. Above all, I have peace of mind that my website is both robust and in safe hands."
                },
                {
                    "reviewer": "Richard Arnold",
                    "reviewer_image": "https://www.google.com/maps/contrib/103399119094419373556?hl=en-US",
                    "review": "James and the team have become our website partner, taking care of everything on our website from initial design right through to management and updates. They are always on hand to take a quick phone call or can schedule a more in depth meeting to meet your needs. I have no reason to go anywhere else for my business website from now on."
                },
                {
                    "reviewer": "Horsepower 4 Hire",
                    "reviewer_image": "https://www.google.com/maps/contrib/113160727363478995851?hl=en-US",
                    "review": "I can't thank James at WeDesign UK enough for his time, patience and expertise in building the perfect website for our brand new small business. Not only is he extremely talented, but he also went above and beyond to make the experience as simple as possible. No detail was too much trouble and he came up with innovative solutions to challenges in delivering our service online. Highly, highly recommended - choose this company to build your website, you won't look back!"
                }
            ],
            "is_spending_on_ads": false
        },
        {
            "place_id": "ChIJl6CjPZ6n2EcRE4D2tkNA-zQ",
            "name": "The UK Web Design Company",
            "link": "https://www.google.com/maps/place/The+UK+Web+Design+Company/data=!4m7!3m6!1s0x47d8a79e3da3a097:0x34fb4043b6f68013!8m2!3d51.5562153!4d0.0192459!16s%2Fg%2F1ptxhh7z4!19sChIJl6CjPZ6n2EcRE4D2tkNA-zQ?authuser=0&hl=en&rclk=1",
            "main_category": "Website designer",
            "categories": [
                "Website designer",
                "Design agency"
            ],
            "rating": 5,
            "reviews": 38,
            "address": "The UK Web Design Company, 129 Thorpe Rd, London E7 9ED, United Kingdom",
            "website": "https://the-web-design-company.co.uk/",
            "about": "Very experienced London website designers with over 23 years of experience. We go above and beyond to help our clients. Offering Web Design Prices that great value & very affordable.\n\nWe provide websites, updates, logos, business card designs and more. Our reputation is impeccable and we have worked very hard to earn it.\n\nOur offices are based in London and Essex.",
            "featured_image": "https://streetviewpixels-pa.googleapis.com/v1/thumbnail?panoid=ru4tefpvknHtVZjRGdZp1w&cb_client=search.gws-prod.gps&w=211&h=120&yaw=72.7036&pitch=0&thumbfov=100",
            "phone": "+447944062954",
            "all_images": "{None, https://streetviewpixels-pa.googleapis.com/v1/thumbnail?panoid=ru4tefpvknHtVZjRGdZp1w&cb_client=maps_sv.tactile.gps&w=224&h=298&yaw=72.7036&pitch=0&thumbfov=100, https://lh5.googleusercontent.com/p/AF1QipMATWhajwPzn0zqsP_7EG3XYOhC3gbuxuLPrF06=w398-h298-k-no, https://lh5.googleusercontent.com/p/AF1QipP2wMHNhdzSeNxkzGzpnLxVajMvD6Qhk2yykWX3=w224-h299-k-no}",
            "detailed_reviews": [
                {
                    "reviewer": "Emma Jane Martin",
                    "reviewer_image": "https://www.google.com/maps/contrib/115829481641130637100?hl=en-US",
                    "review": "Set up our site fast & efficiently! Very methodical and a great help, on hand by call, text or Teams whenever needed, highly recommended! Great work thank you."
                },
                {
                    "reviewer": "Arbind Gupta",
                    "reviewer_image": "https://www.google.com/maps/contrib/103675712184391584735?hl=en-US",
                    "review": "Joe was very professional and worked hard on my website with plenty of innovative ideas\nDr Arbind Gupta"
                },
                {
                    "reviewer": "Federica Romagnolo",
                    "reviewer_image": "https://www.google.com/maps/contrib/107506485002184640033?hl=en-US",
                    "review": "Thanks to Joseph for the brilliant job done for our business website, he gave a  fresh new looking to our old web page. For sure we will give a very good impression to our new client. Highly recommend!!"
                },
                {
                    "reviewer": "Jay Jay",
                    "reviewer_image": "https://www.google.com/maps/contrib/113724147392895040964?hl=en-US",
                    "review": "I would like to thank Joseph from The UK Web Design Company, for doing an excellent job on my most recent website. Joseph listened to my request, and implemented exactly what I was after. His communication efficiency, and overall professionalism during the entire process were consistent and reassuring. Joseph's skillful approach and clarity were very much appreciated, and the end result was exactly what I had imagined! Thank you Joseph."
                },
                {
                    "reviewer": "AG Flooring",
                    "reviewer_image": "https://www.google.com/maps/contrib/106919846906767242461?hl=en-US",
                    "review": "Excellent service provided by Joseph and the Team. Highly recommended!!! great communication, very easy to deal with and they go above and beyond. Brilliant website design, its exactly what we were looking for and very reasonably priced for the service we received, cannot fault a single thing. Very Happy customers!!!"
                },
                {
                    "reviewer": "David Nelson",
                    "reviewer_image": "https://www.google.com/maps/contrib/100394594980785992226?hl=en-US",
                    "review": "We are very excited to be working with Joseph on our global web presence. The attention to detail he has given made sure we had great results with the first site release (no need for endless tweaks and corrections). Very highly recommended."
                },
                {
                    "reviewer": "Global Supercar Solutions",
                    "reviewer_image": "https://www.google.com/maps/contrib/117304653097670302896?hl=en-US",
                    "review": "As a novice to this industry and with all the bad experience have had with other designers. I wished I found you 2 years ago! Joeseph has been so amazing, his communications was fantastic, he was extremely Quick and understands what customers want. Extremely professional\n\nI was so impressed with the speed of his work that he even presented it well before his estimation time!\n\nI strongly recommend this company!"
                },
                {
                    "reviewer": "Alan Gayle",
                    "reviewer_image": "https://www.google.com/maps/contrib/108431745100302564909?hl=en-US",
                    "review": "The Web Design Company we're extremely helpful and supportive from the minute they received our enquiry right through to the finished website going live. They produced exactly what we wanted and created an exceptional modern and future proof website. We was provided with a very personal yet highly professional service, I would  not hesitate to recommend this company to anybody who is looking for a quality website with quality advice and support for a very cost effective price."
                }
            ],
            "is_spending_on_ads": false
        },
        {
            "place_id": "ChIJ--ZcL-ZBckgRoGWM0mDoCZM",
            "name": "Web Choice UK",
            "link": "https://www.google.com/maps/place/Web+Choice+UK/data=!4m7!3m6!1s0x487241e62f5ce6fb:0x9309e860d28c65a0!8m2!3d51.4914871!4d-2.5994386!16s%2Fg%2F1v8y3h7l!19sChIJ--ZcL-ZBckgRoGWM0mDoCZM?authuser=0&hl=en&rclk=1",
            "main_category": "Website designer",
            "categories": [
                "Website designer",
                "E commerce agency",
                "Internet marketing service"
            ],
            "rating": 4.6,
            "reviews": 67,
            "address": "Web Choice UK, Henleaze House, 13 Harbury Rd, Henleaze, Bristol BS9 4PN, United Kingdom",
            "website": "https://www.webdesignchoice.co.uk/",
            "about": "Web Choice UK - Award-winning Digital Marketing Agency. We Build Custom Websites & SEO Strategies That Generate Leads and Sales. We are an award-winning digital marketing agency with offices in London and Somerset, serving clients both locally and internationally since 2009. Our company offers a diverse range of services including Web Design, Web Development, SEO, Social Media Marketing, PPC campaigns, E-mail marketing etc.\nContact us today for a free quote on your project!",
            "featured_image": "https://streetviewpixels-pa.googleapis.com/v1/thumbnail?panoid=CMvqKM7vM8MUhkMP_VL1fg&cb_client=search.gws-prod.gps&w=211&h=120&yaw=23.607988&pitch=0&thumbfov=100",
            "phone": null,
            "all_images": "{https://lh5.googleusercontent.com/p/AF1QipNVXrDtlm1OsnUCjWNYRMhFcXw137YCKI92rh34=w298-h298-k-no, https://streetviewpixels-pa.googleapis.com/v1/thumbnail?panoid=CMvqKM7vM8MUhkMP_VL1fg&cb_client=maps_sv.tactile.gps&w=224&h=298&yaw=23.607988&pitch=0&thumbfov=100, https://lh5.googleusercontent.com/p/AF1QipMX998BFU6iBNldAy1jFUNx7cUYQeimLOJyVt91=w298-h298-k-no, https://lh5.googleusercontent.com/p/AF1QipNNbv5QMk5Af_uDMWZGe3EgCLv1BPqcZyy-FMjX=w529-h298-k-no}",
            "detailed_reviews": [
                {
                    "reviewer": "max black",
                    "reviewer_image": "https://www.google.com/maps/contrib/106055852306120167541?hl=en-US",
                    "review": "i would just like to thank sam and the team for doing such a great job for me, they were patient and had a good understanding of what i needed doing, their work is really amazing  and  i would be happy to continue working with them."
                },
                {
                    "reviewer": "TavernCreative",
                    "reviewer_image": "https://www.google.com/maps/contrib/117861425096899349123?hl=en-US",
                    "review": "Update after their reply: My 1 month paternity leave would have had little impact considering delivery was 12 months later than promised. If anyone is considering using Web Choice and would like to see the emails, timeline of events and issues, feel free to contact me\n\nChoosing Webchoice to create our website was a Badchoice.\n\nIn September 2021 we commissioned them to create our new website with a brief to completely reimagine and redesign our current site. In October the first-look came back and it was almost identical to our existing site. They were kind enough to start again and we approved the new look, with a 3-month timeline for the build.\n\nAfter the 3 months I began questioning when it would be ready. 'Very soon' I was assured. In April 2022 our existing WIX subscription was up for renewal, so I chased up again and I was told the website was almost complete. I didn't renew out WIX site and accepted we may have a few weeks without a live website.\n\nBy July 2022 we still didn't have a website and I continued to chase. Despite being very meticulous in ensuring there would be no hidden costs in the early days, I was told they couldn't upload our products and would need to charge me PS300+ to do this manually. Reluctantly I paid as I was conscious we were losing thousands per month by not having a website at all.\n\nBy September 2022 there was still no sign of the website and I had finally lost my patience with them and asked to cancel and refund. They of course refused and suggested I can either take legal action or allow them to direct additional resources to get the job done. I accepted the additional resources with a new completion date of December 2022.\n\nBy December 2022 the website was still not complete. I was dealing with one or two people based in India and they weren't able to clarify to me what the 'extra resources' were. It was clear to me by this point they lacked the expertise to complete the job but failed to admit their shortcomings.\n\nOur busy period is January-March, so in January 2023 I asked them to launch the site on the basis that it was better for us to have some online presence rather than none at all, after losing 8 months of website revenue in the previous year.\n\nThe website launched unfinished and I was forced to instruct a new company to complete the work at the cost of PS800+. The new company completed the work without issue in a matter of weeks. They noted the initial 3-5 hour of work billed to me was spent cleaning up the mess Webchoice had made.\n\nIn addition all of the products I had paid them PS300 to add to the site had to be removed and replaced, as they had used low res images on every listing, the pricing was wrong on most products and the listing descriptions didn't match the products they were listed under.\n\nAfter 4 months since launch we're still having countless issues with our site, most notably a plugin they used to create the building blocks of the design and layout. The plugin they used was a free version, which has now expired forcing me to either redesign the site from scratch or pay the costly subscription for this plugin.\n\nThe website I paid PS10,000 for was nothing more than a wordpress template. A website I could have designed myself and wish I had.\n\nI chose Webchoice because I wanted an outstanding website to take our business to the next level and instead I was met with a team of amateurs who simply outsourced their work to India and then became very defensive whenever I questioned their actions and delays - blaming anyone but themselves and failing to accept they simply could not do the job."
                },
                {
                    "reviewer": "LinkNLearn Training",
                    "reviewer_image": "https://www.google.com/maps/contrib/114018073184235977667?hl=en-US",
                    "review": "These guys know their stuff! Grade A - I've known Sam for a long time and he is a real expert. Can't recommend them enough"
                },
                {
                    "reviewer": "Andrew Whitman",
                    "reviewer_image": "https://www.google.com/maps/contrib/105390751387888359995?hl=en-US",
                    "review": "I approached Web Choice UK about developing a fairly niche website for me personally, with quite a complex agenda (at least as a relatively non-techy person!). It was to help me promote a book and tour I am working on about about the history of the Jesus People revival in the late 60s and early 70s. The team definitely grasped what I was trying to achieve really ably.\n\nThe team have been incredibly helpful from start to finish, and nothing has been too much trouble. They also know how to communicate in a way that's accessible to someone like me who is not that knowledgeable about websites. The quality of their work has been high calibre, and has already met with great responses from those in a similar space to me...\nIn particular they have worked well to deadlines too. My calls for tweaks have been met with courtesy and efficiency as well...\n\nI would say the price was excellent value as well, which I'm very pleased about as I had a specific budget in mind, which was not massive, due to my work being essentially charitable really.\n\nA truly professional job all-round, with great customer satisfaction on my part. This website will make a huge difference to my ongoing work... Many thanks Tom, Philip and the team!"
                },
                {
                    "reviewer": "Callum Bridgford-Whittick (FiftyCal)",
                    "reviewer_image": "https://www.google.com/maps/contrib/117036677300987287960?hl=en-US",
                    "review": "Teamed up with these guys for websites and SEO - solid results and team. Well worth  a convo for your project."
                },
                {
                    "reviewer": "Tom Breza",
                    "reviewer_image": "https://www.google.com/maps/contrib/112035209738473002746?hl=en-US",
                    "review": "Sam and his team created an amazing website for us. It is responsive, looks great.\n\nI am glad we have picked this team for the task as IT company frequently we are asked to recommend someone to help with the website and I will pass Sam details."
                },
                {
                    "reviewer": "aasim chowdhury",
                    "reviewer_image": "https://www.google.com/maps/contrib/107051251480585387450?hl=en-US",
                    "review": "GMS Tech supported us in web design, development and digital marketing. Thanks to their knowledge and determination our website looks great, it functions really well and includes a high level of interactivity. Would highly recommend to anyone!"
                },
                {
                    "reviewer": "Consenna Visualising Value",
                    "reviewer_image": "https://www.google.com/maps/contrib/105900078204367066428?hl=en-US",
                    "review": "From the moment I contacted Web Choice their speed of response and quality of service was evident. Sam responded within two hours of me leaving my contact details on their website. He quickly set up a project scoping call and it was clear that he'd read and understood our brief. We made it clear that we were looking for a world class website. We were impressed with the Web Choice approach. Sam then sent us a quotation with a detailed cost break-down. The pricing was favourable in comparison to other quotes we'd had. Once we agreed to proceed we were sent the Web Choice welcome deck which detailed their thorough process . Next we had our kick-off meeting. Sam was our project manager however Tom and Rijo were also extremely helpful and responsive throughout the process. Web Choice were patient with us and allowed us to tweak elements of the design, text and animation. We're delighted with our website both from a user experience and design perspective. The website is responsive and works brilliantly on any device. Web Choice exceeded our expectations. I can't recommend them highly enough."
                }
            ],
            "is_spending_on_ads": false
        }
    ]
}